# -*- coding: utf-8 -*-
import unittest
import re
from p8 import *

class KISSSampleTest(unittest.TestCase):

    def test_sample(self):
        source = """= Пасивност. Невежество. Сивота =
Двеста хиляди мъже и жени. Двеста хиляди ковачи, оръжейници, месари, галантеристи, златари, домакини, проститутки, монаси, сарафи, войници, скитници, оцелели книжници се въртяха сега в душните, вмирисани на дървеници легла; спяха, любеха се, пресмятаха наум печалбите, плачеха, скърцаха със зъби от злоба или от обида...

[quote]Трудно е да бъдеш бог[/quote]

Още за братя Стругацки:
* http://www.sfbg.us/authors/a/arkadij_strugacki/index-ebk.html, текстове
* Сарказъм++

* Разказах.  В  края  на  разказа си убедително помолих лентенанта да не
разглежда постъпката ми като опит да натрупам пари за "Запорожец".

"""
        expected = """<h1>Пасивност. Невежество. Сивота</h1>
<p>Двеста хиляди мъже и жени. Двеста хиляди ковачи, оръжейници, месари, галантеристи, златари, домакини, проститутки, монаси, сарафи, войници, скитници, оцелели книжници се въртяха сега в душните, вмирисани на дървеници легла; спяха, любеха се, пресмятаха наум печалбите, плачеха, скърцаха със зъби от злоба или от обида...</p>
<p><span class="quote">Трудно е да бъдеш бог</span></p>
<p>Още за братя Стругацки:</p>
<ul>
<li><a href="http://www.sfbg.us/authors/a/arkadij_strugacki/index-ebk.html">http://www.sfbg.us/authors/a/arkadij_strugacki/index-ebk.html</a>, текстове</li>
<li>Сарказъм++</li>
</ul>
<p>* Разказах.  В  края  на  разказа си убедително помолих лентенанта да не<br />
разглежда постъпката ми като опит да натрупам пари за "Запорожец".</p>
"""
        self.assertEqual(*(re.sub(r'\s+', '', s) for s in (expected, kiss(source))))
    
if __name__ == '__main__':
    unittest.main()